app/controllers/assgn_controller_controller.rb

  def show
    @assgn = Assignments.find(params[:id])
---
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 1 LIMIT 1