app/controllers/assignments_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
SELECT `assignments`.* FROM `assignments`
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
---
       def show
       		ActiveRecord::Base.include_root_in_json = true
            @user = User.find(params[:id])
  	    	  @course = @user.mycourses
            @assgn = Assignments.all
            @courseJSON = @course.to_json

            # respond_to do |format|
            #   format.html # index.html.erb
            #   format.json { render :json => {:course => @course}}
            # end

            #GET ALL THE STUDENTS OF THE COURSES
               crs_std = []
              JSON.parse(@courseJSON).each do |assgn|
                @assgn_temp = Course.find(assgn["id"])