app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT `assignments`.* FROM `assignments`

  def show
    @assignment = Assignment.find(params[:id])
---
SELECT `assignments`.* FROM `assignments` WHERE `assignments`.`id` = 1 LIMIT 1

  def studinfo
    ActiveRecord::Base.include_root_in_json = true
    @getcrs =[]
    @course_stats = Hash.new
    @std_stats = Hash.new
    @user = current_user
    @course = @user.mycourses #Professor courses
    @courseJSON = @course.to_json
    @getcrs= []
     JSON.parse(@courseJSON).each do |std_crs|
      #get the students of the courses
      @std_crs = Course.find(std_crs["id"])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 9 LIMIT 1

  def courseasgns


    ActiveRecord::Base.include_root_in_json = true
    @getcrs =[]
    @course_stats = Hash.new
    @std_stats = Hash.new
    @user = current_user
    @course = @user.mycourses #Professor courses
    @courseJSON = @course.to_json
    @getcrs= []
     # JSON.parse(@courseJSON).each do |std_crs|
      #get the students of the courses
      @std_crs = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 9 LIMIT 1