app/controllers/professors_controller.rb

  def show



    @professor = Professor.find_by_user_id(params[:id])
      @courses = current_user.mycourses
      @temp_students = []
      @temp_assignments = []
      @courses.each do |c|
---
SELECT `professors`.* FROM `professors` WHERE `professors`.`user_id` = 1 LIMIT 1
SELECT code FROM `courses` WHERE (course_id = '1')

  def edit
    @professor = Professor.find_by_user_id(params[:id])
---
SELECT `professors`.* FROM `professors` WHERE `professors`.`user_id` = 7 LIMIT 1