app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`utorid` = 'bashirm1' LIMIT 1
SELECT `students`.* FROM `students` WHERE `students`.`user_id` = 1 LIMIT 1
SELECT `professors`.* FROM `professors` WHERE `professors`.`user_id` = 1 LIMIT 1
---
	def create
	    user = User.find_by_utorid(params[:session][:utorid].downcase)
	    if user && user.authenticate(params[:session][:password])
	      sign_in user
	      student = Student.find_by_user_id(user.id)
	      professor = Professor.find_by_user_id(user.id)