app/controllers/users_controller.rb

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 9 LIMIT 1
---
  def mystudents_courses
    @courses = Course.find(params[:id])